       IDENTIFICATION DIVISION.
       PROGRAM-ID. sigalrm-handler.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-ALRM-WAS-RAISED PIC X EXTERNAL.
       PROCEDURE DIVISION.

       MOVE 'Y' TO WS-ALRM-WAS-RAISED.

       END PROGRAM sigalrm-handler.
